In [1]:
import pandas as pd

In [3]:
df_1 = pd.DataFrame({
    'workers' : ['John','Mike','Carey','Jennifer'],
    'groups'  : ['Software','Dentistiry','Electric','Rescue']
})

df_1

    workers      groups
0      John    Software
1      Mike  Dentistiry
2     Carey    Electric
3  Jennifer      Rescue

In [6]:
df_2 = pd.DataFrame({
    'workers' : ['John','Mike','Carey','Jennifer'],
    'male'  : ['M','M','F','F']
})

df_2

    workers male
0      John    M
1      Mike    M
2     Carey    F
3  Jennifer    F

In [7]:
pd.merge(df_1,df_2)

    workers      groups male
0      John    Software    M
1      Mike  Dentistiry    M
2     Carey    Electric    F
3  Jennifer      Rescue    F

In [10]:
pd.merge(df_1,df_2, on = 'workers')

    workers      groups male
0      John    Software    M
1      Mike  Dentistiry    M
2     Carey    Electric    F
3  Jennifer      Rescue    F

In [11]:
#Many to single

In [13]:
df3 = pd.merge(df_1,df_2)
df3

    workers      groups male
0      John    Software    M
1      Mike  Dentistiry    M
2     Carey    Electric    F
3  Jennifer      Rescue    F

In [ ]:
d